{
    "questions": [
        {
            "id": 0,
            "question_en": "What is the purpose of the Van de Graaff generator?",
            "question_fi": "Mihin Van de Graaff -generaattoria käytetään?",
            "answer_en": "A Van de Graaff generator accumulates and transfers high-voltage static electricity, often to demonstrate hair-raising electrostatic effects in classrooms.",
            "answer_fi": "Van de Graaff -generaattori kerää ja siirtää suuria määriä staattista sähköä. Sitä käytetään usein hiuksia pystyyn nostattavien sähköilmiöiden esittelyyn luokkahuoneissa.",
            "category": "SCIENCE"
        },
        {
            "id": 1,
            "question_en": "Why do some lizards shoot blood out of their eyes?",
            "question_fi": "Miksi jotkut liskot ampuvat verta silmistään?",
            "answer_en": "Certain lizards, like the horned lizard, can shoot blood from their eyes as a defense mechanism to scare off predators — especially if the predator finds blood gross.",
            "answer_fi": "Tietyt liskot, kuten sarvilisko, voivat puolustautuessaan ruiskuttaa verta silmistään pelottaakseen saalistajia — erityisesti niitä, jotka inhoavat verta.",
            "category": "SCIENCE"
        },
        {
            "id": 2,
            "question_en": "What is a tardigrade and why is it basically invincible?",
            "question_fi": "Mikä on karhukainen ja miksi se on käytännössä voittamaton?",
            "answer_en": "A tardigrade is a microscopic creature that can survive boiling, freezing, radiation, and even the vacuum of space by entering a dehydrated, dormant state called cryptobiosis.",
            "answer_fi": "Karhukainen on mikroskooppinen eliö, joka voi selviytyä kiehuvasta kuumuudesta, pakkasesta, säteilystä ja jopa avaruuden tyhjiöstä vaipumalla kuivuneeseen, horrosmaiseen tilaan nimeltä kryptobioosi.",
            "category": "SCIENCE"
        },
        {
            "id": 3,
            "question_en": "What was the function of the 'duck test' in nuclear bomb development?",
            "question_fi": "Mitä tarkoitti 'ankkatesti' ydinasekehityksessä?",
            "answer_en": "The 'duck test' was an informal term scientists used during nuclear testing — if something looked like a bomb, acted like a bomb, and exploded like a bomb… well, it probably was a bomb.",
            "answer_fi": "'Ankkatesti' oli epävirallinen ilmaus ydinasekehityksessä: jos jokin näytti pommilta, toimi kuin pommi ja räjähti kuin pommi... se oli todennäköisesti pommi.",
            "category": "SCIENCE"
        },
        {
            "id": 4,
            "question_en": "Why do cats appear to defy the laws of physics when they land on their feet?",
            "question_fi": "Miksi kissat näyttävät rikkovan fysiikan lakeja laskeutuessaan jaloilleen?",
            "answer_en": "Cats use an innate ability called the 'cat righting reflex', which allows them to twist their bodies mid-air without violating angular momentum — physics just has to accept it.",
            "answer_fi": "Kissoilla on synnynnäinen 'kissan oikaisurefleksi', jonka avulla ne voivat kiertyä ilmassa jaloilleen ilman, että ne rikkoisivat kulmamomentin säilymistä — fysiikka joutuu vain hyväksymään sen.",
            "category": "SCIENCE"
        },
        {
            "id": 5,
            "question_en": "",
            "question_fi": "Mihin tarkoitukseen käytettiin aikoinaan Ludlow-kolikkomittaria?",
            "answer_en": "",
            "answer_fi": "Se mittasi työväen asuntojen kaasun kulutusta kolikkojen avulla",
            "category": "SCIENCEHARD"
        },
        {
            "id": 6,
            "question_en": "",
            "question_fi": "Mikä on triboluminesenssi ja missä sitä esiintyy?",
            "answer_en": "",
            "answer_fi": "Se on valon välähdys, joka syntyy kun aineita murskataan, esim. kun purukumia puretaan",
            "category": "SCIENCEHARD"
        },
        {
            "id": 7,
            "question_en": "",
            "question_fi": "Miksi vanhoissa sukelluspuvuissa oli painavat kengät?",
            "answer_en": "",
            "answer_fi": "Ne piti sukeltajan tasapainossa ja esti kellumasta hallitsemattomasti",
            "category": "SCIENCEHARD"
        },
        {
            "id": 8,
            "question_en": "",
            "question_fi": "Mikä on Zweckform 222 ja miksi se oli tärkeä 60-luvulla?",
            "answer_en": "",
            "answer_fi": "Se oli saksalainen lomakepohja, jota käytettiin tietokoneohjelmoinnin opettamiseen",
            "category": "SCIENCEHARD"
        },
        {
            "id": 9,
            "question_en": "",
            "question_fi": "Miksi jotkut säteilytyypit voivat ionisoida ilman mutta toiset ei?",
            "answer_en": "",
            "answer_fi": "Vain tarpeeksi energiset säteilyt pystyy irrottamaan elektroneja ilmamolekyyleistä",
            "category": "SCIENCEHARD"
        },
        {
            "id": 10,
            "question_en": "",
            "question_fi": "Mihin perustuu vanha tekniikka nimeltä 'herätemagnetismi'?",
            "answer_en": "",
            "answer_fi": "Siinä magneettisuus syntyy kun rautakappale asetetaan toisen magneetin kenttään",
            "category": "SCIENCEHARD"
        },
        {
            "id": 11,
            "question_en": "",
            "question_fi": "Mitä tarkoittaa 'kaasukromatografia' ja mihin sitä käytetään?",
            "answer_en": "",
            "answer_fi": "Se erottaa seoksen kaasuiksi ja analysoi niiden koostumuksen",
            "category": "SCIENCEHARD"
        },
        {
            "id": 12,
            "question_en": "",
            "question_fi": "Miksi suprajohtava materiaali hylkii magneettikenttää?",
            "answer_en": "",
            "answer_fi": "Koska sen sisällä ei ole sähkövastusta, kenttä ei pääse tunkeutumaan aineeseen",
            "category": "SCIENCEHARD"
        },
        {
            "id": 13,
            "question_en": "",
            "question_fi": "Mikä tekee vesinokan nenästä niin erikoisen aistinelimen?",
            "answer_en": "",
            "answer_fi": "Se voi aistia sähköisiä impulsseja vedessä olevista saaliista",
            "category": "SCIENCEHARD"
        },
        {
            "id": 14,
            "question_en": "",
            "question_fi": "Miten neutronitähti voi pyöriä tuhansia kertoja sekunnissa?",
            "answer_en": "",
            "answer_fi": "Koska sen koko romahtaa mutta liikemäärä säilyy, pyöriminen kiihtyy",
            "category": "SCIENCEHARD"
        }
    ]
}